ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
// code for a boot loader for PIC32 (and other?) MCUs
// Chris Lomont May 2015
#include <stdint.h>  // basic types like uint16_t, etc.
#include <stdbool.h> // type bool
#include <xc.h>      // standard part port definitions

#include "BootLoader.h"

/************************** Overview *******************************************
 *
 * This is a bootloader for PIC32 MCUs, written by Chris Lomont for Hypnocube.
 * It allows flashing PICs from (optionally) encrypted images for upgrading PIC
 * applications in the field. Read the Usage section to see how to use it.
 * www.hypnocube.com
 *  May 2015 - Version 0.5 - initial release
 *
 ******************************************************************************/


/************************** Usage: *********************************************
 *
 *  1. Add this file (BootLoader.c) to your program.
 *     This makes keeping the config bits in sync; the bootloader and main
 *     program need to share configuration bits.
 *  2. The bootloader needs to reside in a fixed location in FLASH. It uses the
 *     lowest address user FLASH (not the boot flash - see the notes section).
 *     To position it in memory, you must add and modify the linker script:
 *     
 *     This is in Microchip directories, has the same name as your PIC with a
 *     *.ld extension. For example, if you're using a PIC32MX150F128B, find the 
 *     file named p32MX150F128B.ld, and make a copy in your project directory.
 *
 *     Add this file to your project; now the linker will use your copy instead
 *     of the default one.
 *
 *     To reserve a space for the bootloader, edit your copy of the linker
 *     script as follows: near the file beginning, in the MEMORY section,
 *     find the kseg0_program_mem line:
 
 *         kseg0_program_mem     (rx)  : ORIGIN = 0x9D000000, LENGTH = 0x1F000
 *
 *     Subtract 0x1800 from the LENGTH, add it to the ORIGIN, and insert
 *     another entry like so. This split the memory section into two. Depending
 *     on compiler options, you may have to increase this 0x1800 as needed.
 *
 *         hypnocube_bootcode    (rx)  : ORIGIN = 0x9D000000, LENGTH = 0x1800
 *         kseg0_program_mem     (rx)  : ORIGIN = 0x9D000000+0x1800, LENGTH = 0x1F000-0x1800
 *
 *     Also reserve one word in RAM by similarly splitting the line
 *
 *         kseg1_data_mem       (w!x)  : ORIGIN = 0xA0000000, LENGTH = 0x8000
 *
 *     into two
 * 
 *         hypnocube_bootram    (w!x)  : ORIGIN = 0xA0000000, LENGTH = 0x4
 *         kseg1_data_mem       (w!x)  : ORIGIN = 0xA0000004, LENGTH = 0x8000-4
 *
 *     These two changes made room in flash and ram for our uses. Right after 
 *     the closing brace in the memory section, add this line
 * 
 *         _HCBOOT_LD_SIZE_ = LENGTH(hypnocube_bootcode);
 *
 *     which defines a symbol used in the code to determine the bootloader 
 *     code area to protect.
 * 
 *     Now we have to tell the linker what to put in these locations using
 *     SECTIONs. So, before the .text: section definition, add these sections 
 *     to map the code to this memory section:
 *
 *        .hcbcode :
 *        {
 *          *(.hcbcode.*)
 *          *(.hcbcode)
 *          KEEP (*(.hcbcode))
 *          KEEP (*(.hcbcode.*))
 *          . = ALIGN(4) ;
 *        } >hypnocube_bootcode
 *        .hcbram :
 *        {
 *          *(.hcbram.*)
 *          *(.hcbram)
 *          KEEP (*(.hcbram))
 *          KEEP (*(.hcbram.*))
 *          . = ALIGN(4) ;
 *        } >hypnocube_bootram
 *
 *     Now the bootloader code and single variable will be located correctly.
 *
 *
 *  3. To make the bootloader called on power up, you need to modify the C
 *     runtime startup code.
 *
 *     Locate the crt0.S file in the Microchip distribution, and copy it to
 *     your project. Rename it to BootLoader_crt0.S. The capital S is important.
 *     Change the project linker settings to not link the default startup code
 *     (Properties -> XC32 -> xc32-ld -> libraries -> Do not link startup code)
 *
 *     Change the compiler to emit sections for each function and variable
 *     by changing two options under g++ (Isolate each function in its own
 *     section AND Place data in its own section).
 *
 *     Edit it to call the bootloader before (almost) anything else is done.
 *     Right after the _startup: symbol, insert these lines (do not insert a
 *     second startup symbol):
 *
 * _startup:
 *
 *       ##################################################################
 *       # Bootloader jump added by Chris Lomont from Hypnocube. If this is
 *       # changed, the check code in the bootloader must be changed, since
 *       # exactly this code sequence must appear early in the reset area
 *       ##################################################################
 *       la      sp,0xA0000000 + 8*1024 # all PIC32s have at least 16K RAM, use 8
 *       la      t0,BootloaderEntry     # boot address, always same location
 *       jalr    t0                     # jump and link so we can return here
 *       nop                            # required branch delay slot, executed
 *
 *     It is important these lines compile to reside very near the beginnging
 *     of the reset entry point, because the bootloader will not allow
 *     overwriting of this location without the same code snippet occurring.
 *
 *  4. Edit parameters in the user defines section. The SYS_CLOCK needs to match
 *     your device on power up, and DESIRED_BAUDRATE and uart used need to match
 *     your design.
 *
 *     You may need to implement code for other UART ports or PICs than are here
 *     already. Please submit fixes and changes back to Chris Lomont so they
 *     can be incorporated.
 *
 *  5. Compile with the small, optimized code setting, otherwise the bootloader
 *     will not fit in the 0x1000 bytes from above. If you don't have that
 *     compiler, increase the sizes above to 0x2000 or whatever you need to get
 *     it to fit.
 *
 *     The size must be an integral number of flash pages. Check your page
 *     sizes.
 *
 *  6. Read the Notes section for more information.
 *
 ******************************************************************************/


/************************** User defines **************************************/
// You must set the clock speed the same as the boot up settings for the device
// this clock is used for timing and setting the UART baud rate
#define SYS_CLOCK 48000000L           // system clock, ticks go half this rate
#define TICKS_PER_MILLISECOND ((SYS_CLOCK)/2000)
#define TICKS_PER_MICROSECOND ((SYS_CLOCK)/2000000)

// define this to allow flashing the BOOT flash section
// this is recommended - the bootloader still protects its own
// code which is stored at the lowest FLASH addresses
#define ALLOW_BOOTFLASH_OVERWRITE

// UART baud rate
#define DESIRED_BAUDRATE 1000000   
// Define a UART (UART1, UART2, etc) to use. You must add code cases as needed
#define HC_UART1
// #define HC_UART2

// Number of milliseconds to look for flashing tool at boot. 
#define BOOT_WAIT_MS 1000

