ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
// define this to use encrypted images, else unencrypted
#define USE_CRYPTO

#ifdef USE_CRYPTO
// If encrypted, you need a 32 byte key, stored here as eight 4 byte values
// These get written as the key, word 0 first (lowest address), each stored
// big endian into a byte array
#define PASSWORD_WORD0 0x12345678
#define PASSWORD_WORD1 0x12345678
#define PASSWORD_WORD2 0x12345678
#define PASSWORD_WORD3 0x12345678
#define PASSWORD_WORD4 0x12345678
#define PASSWORD_WORD5 0x12345678
#define PASSWORD_WORD6 0x12345678
#define PASSWORD_WORD7 0x12345678
#endif


// To have some blinking LED feedback, define these for your device
// otherwise leave blank
//#define LED_INIT()
//#define LED_ON()
//#define LED_OFF()
//#define LED_TOGGLE()
// example, if PORTA, pin RA1, is tied to a LED:
#define LED_INIT()   LATACLR = 1<<1; TRISACLR = 1<<1
#define LED_ON()     PORTAbits.RA1=1
#define LED_OFF()    PORTAbits.RA1=0
#define LED_TOGGLE() PORTAbits.RA1^=1


// needed defines for each PIC type - todo - group them nicely
#if defined(__32MX150F128C__) || defined(__32MX150F128B__)
#define FLASH_PAGE_SIZE 1024 // bytes
#define FLASH_ROW_SIZE   128 // bytes

#else

error! need defines for your chip

#endif

// todo - clean and orgainze these better
// memory regions, end is one past usable end
// all values are PHYSICAL addresses, not logical
// most (all) are the same across chips
#define RAM_START            0x00000000
#define RAM_END              ((RAM_START) + (BMXDRMSZ))
#define FLASH_START          0x1D000000
#define FLASH_SIZE           (BMXPFMSZ)
#define FLASH_END            ((FLASH_START) + (FLASH_SIZE))
#define PERIPHERAL_START     0x1F800000
#define PERIPHERAL_END       0x1F900000
#define BOOT_START           0x1FC00000
#define BOOT_SIZE            (BMXBOOTSZ)
#define BOOT_END             ((BOOT_START) + (BOOT_SIZE))
// note config may be in the boot flash region
#define CONFIGURATION_START  0x1FC00BF0
#define CONFIGURATION_END    0x1FC00C00

// logical address for flash regions
#define FLASH_START_LOGICAL  0xBD000000
#define BOOT_START_LOGICAL   0xBFC00000



/*********************** Notes *************************************************
 * TODO - check all TODOs :)
 *
 * todo - errors allowed from flash side - mention which
 *
 * TODO - clean this section, organize, split
 * Original idea to make a boot flash bootloader is fraught with problems:
 *  1. Boot flash is small, 3K = 0xD00, on many PICs
 *  2. Boot flash has a debug executive in it, and several fixed addresses
 *     that need exception vectors (Reset, boot exception, etc.)
 *  3. Debug executive takes significant space (0x760)
 *  4. These vectors are set to point to code in the CRT in non-boot flash at
 *     link time, so any recompile of the use app may move these vectors
 *  5. Could fiddle with linker script, and crt enough to make all work, ....
 *  6. But this is hard to maintain over time as crt changes....
 *  7. So - we make boot code at a fixed, protected address, and the user
 *     program should call it first thing. Then boot loader allows flashing the
 *     boot area itself to allow user changes to crt, etc.
 *  8. Downside - some chance of the boot loader wiping the code that is called
 *     before it.
 *  9. All this would be ok on 12K boot flash PICs. Make version for there.
 *
 * BOOT FLASH layout (3K version)
 * 0x0000 - 0x037F : 0x380 space, execution starts here
 * 0x0380 - 0x047F : space? boot exception vector
 * 0x0480 - 0x048F : 0x10 space, debug exception vector jumps into normal FLASH
 * 0x0490 - 0x0BDF : 0x760 space, debug code executive, needed to debug
 * 0x0BF0 - 0x0BFF configuration registers
 *
 * NOTE: config in boot flash - erasing this page erases config bits. Cannot do this!
 *       Thus we block all access to this page (0x800-0xBFF). This may break the
 *       debug executive, but should allow changes to be made to the exception vectors
 *       which is more important
 *
 *
 * "How to Get the Least out of your PIC32 C compiler"
 * http://www.microchip.com/stellent/groups/SiteComm_sg/documents/DeviceDoc/en557154.pdf

 *
 * takes a few times to connect under Windows - not sure why - 400ms, seconds...
 *  *
 * DEVCFG0 bits
 *    CP  : prevent flash reading/modification from external device 0=enabled, 1=disabled
 *    BWP : prevent boot flash from being modified during code execution 0=not writeable, 1=writeable
 *    PWP : prevent selected flash pages form being modified during code execution
 *        111111111 = disabled
 *        111111110 = address below 0x0400 protected
 *        111111101 = address below 0x0800 protected
 *        ....
 *        011111111 = address below 0x40000 (256K) protected
 *        ...
 *        000000000 = all possible memory protected
 *   ICESEL : ICD pins select PGECx/PGEDx x = 1,2,3,4 for bits 11,10,01,00
 *   JTAGEN, DEBUG,
 * DEVCFG1 bits : lots of watchdog timer stuff, clock oscillator stuff
 * DEVCFG2 bits : more clock stuff, USB stuff,
 * DEVCFG4 bits : USB stuff, peripheral pin stuff, USERID
 *
 *    
 *
 * todo - uses lots of stack!
 *
 *  . Compile with optimized, else bigger linker spaces
 *
 * n. Define for your PIC if not present
 * Read notes for help, info
 *
 * TODO: explain if use modified CRT, remove link option from linker
 * Theory of operation: todo
 *
 *
 * // compile with size flags to make small enough
// why not in boot sector (contention...), avoids address of main using crt.0

 *

 * _RESET_ADDR, _BEV_EXCPT_ADDR, _DBG_EXCPT_ADDR and _DBG_CODE_ADDR are all
 * determined by the chip's hardware, cannot change them.
 *
 * _RESET_ADDR                    -- Reset Vector
 * _BEV_EXCPT_ADDR                -- Boot exception Vector
 * _DBG_EXCPT_ADDR                -- In-circuit Debugging Exception Vector
 * _DBG_CODE_ADDR                 -- In-circuit Debug Executive address
 * _DBG_CODE_SIZE                 -- In-circuit Debug Executive size
 * _GEN_EXCPT_ADDR                -- General Exception Vector
 *************************************************************************
_RESET_ADDR                    = 0xBFC00000;
_BEV_EXCPT_ADDR                = 0xBFC00380;
_DBG_EXCPT_ADDR                = 0xBFC00480;
_DBG_CODE_ADDR                 = 0x9FC00490;
_DBG_CODE_SIZE                 = 0x760;
_GEN_EXCPT_ADDR                = _ebase_address + 0x180;

 * Logical addresses
 * KSEG0  0x80000000 - 0x9FFFFFFF is the same (overlaps) as
 * KSEG1  0xA0000000 - 0xBFFFFFFF
 * RAM    0x80000000 & 0xA0000000
 * FLASH  0x9D000000 & 0xBD000000
 * Peripherals         0xBF8000000 ONLY

 * BOOT   0x9FC00000 & 0xBFC00000, LENGTH = 0xD00  (3K) or 0x3000 (12K)
 * CONFIG 0x9FC00BF0 & 0xBFC00BF0, LENGTH = 0x010  NOTE: overlaps boot flash!
 *
 * So, BOOT flash in 3K bootloaders is mostly used by Debug Executive, only have
 * 0x000 - 0x380 and 0x390-0x480 =
 *
 *
 * http://microchip.wikidot.com/32bit:mx-arch-exceptions-entry-points
 * The Reset, Soft Reset, and NMI exceptions are always vectored to location 0xBFC00000 (uncached, start-up safe KSEG1 region).


