ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
/*
 * TODO - future versions
 * Bootloader version at fixed address
 *
 *

 *
 C:\Users\Chris\SkyDrive\Hypnocube\Code\BootLoader.X\build\default\production>"\P
rogram Files (x86)\Microchip\xc32\v1.30\bin\xc32-objdump.exe" -S BootLoader.o |
more*
 *
// to use DEBUG_BOOTLOADER must make linker script mem larger

// all functions start with Boot and use BOOT_FUNC to locate properly
// can use x32-objdump -x Bootloader.o to see where items went
// can use gcc options to place data and functions in own sections to get more info
        // (in XC32/bin directory)

/* Features needed/desired
 *   1. UART (serial) support, possible Ethernet, SD card, SPI, etc?
 *   2. Can identify device to make sure not loading wrong items
 *   3. Protected from overwriting itself
 *   4. Setting of baud rate at compile time
 *   5. Encryption
 *   6. Compression
 *   7. Blinking LED when available
 *   8. Small RAM footprint (small enough for all PICs)
 *   9. Page size set by PIC type
 *  10. Error checking/re-transmission
 *  11. Fires on boot, waits, then if nothing, does normal main
 *  12. Small, works on all(?) PIC32?
 * . how to identify boot loading
 * . verify mode?
 * . CRC32K throughout
 *   . can also load unencrypted -
 *  . bootloader Version #
 * . error messages/bytes/stats
 * . NO: did not need - modified crt0.s must modify linker script - possibly can make same file with defines used here and included in linker script?
 * . explain how to check linker/load sections
 * . looked at symmetric and public key methods - if either decryption key lifted from device, irrelevant, so pick symmetric:
 * .chacha?
 *   - XXTEA seems good enough even though much weaker than AES. It's also very small
 *   - use ciphertext stealing to keep data short
 *   - use some block chaining format
 *   - send data in blocks with CRC allowing resends? Or one large block with CRC and verify?
 *   -
 */


// switch ACK in some cases to ACK,reason,CRC? used for counting progress on erase?
// //  x when erasing: send to the PC the number of pages to be erased, then send ack (BTLDR_ERASE) for each
//    erased page (in order to use progress bar in PC software). When finished send BTLDR_OK


/* Protocol
 * 1. Flasher application sends repeating ACK command over the serial port
 *    Note there may be no serial port, since the device is not powered up,
 *    so the flasher will poll the port.
 * 2. Power up Device to be flashed. It waits some amount of time (1 sec? 2 secs?)
 *    looking for an ACK command from the Flasher.
 * 3. If Device sees ACK, sends back ACK, enters command loop
 * 4. If Device does not see ACK within timeout, returns into user code.
 * Command Loop - this is a loop, in client/server mode:
 *    Flasher sends command, Device responds.
 *
 * Commands: (each ASCII byte, some have additional data)
 *    'I' (0x49) = Identify. No data. Respond ? bytes info
 *        Useful fields: bootloader version, product version, PIC version?
 *        memory locations
 *        Responds with DATA CRC
 *    'C' (0x43) = CRC. Compute CRC32K over all flash, and output text, then ACK.
 *    'E' (0x45) = Erase. Send 'E' Address CRC, responds ACK CRC
 *    'W' (0x57) = Write. Send 'W' Address Length CRC, returns ACK CRC or NACK CRC
 *    'Q' (0x51) = Quit. Send 'Q'CRC. Return ACK then Device exits boot loader.
 */

// todo - make sure no strings in here that are not in this boot flash
        
/* Notes:
 * 1. Boot loader and app must have same config bits. Needed to compile together to make all work nicely. TODO - test standalone app.
 *
 *
 *
 * From http://microchip.wikidot.com/faq:85  "(XC32) How do I link in my own custom startup-code, with the XC32 Compiler? "
 * 1. Copy the default startup code "crt0.S?, available under the folder ?<Compiler-DIR>\pic32-libs\libpic32\startup?, to your project directory.
 * 2. Customize this Startup code, by making the changes as required.
 * 3. Add this modified startup code (crt0.S) to the MPLAB® X IDE Project under ?Source Files?.
 *    You may also change the name of your custom startup code to something like 'my_startup.S'.
 * 4. Set the options to exclude linking of default Startup code.
 *    Under MPLAB X IDE go to:
 *    File ? Project Properties ? xc32-ld ? Option categories = Libraries ? Check the option 'Do not link startup code' ? Click 'Ok'
 * 5. The code will now link with the customized startup code.
 *    Note that the default startup code source, crt0.S, uses many device-specific macros that should be defined as appropriate for your target device.
 *
 *
 * I modified the file by adding the 4 lines:
 *      # added by Chris Lomont at hypnocube to enable the boot loader
        la      t0,BootloaderEntry
        jalr    t0
        nop
 *
 * before the section starting with:

        ##################################################################
        # Call main. We do this via a thunk in the text section so that
        # a normal jump and link can be used, enabling the startup code
        # to work properly whether main is written in MIPS16 or MIPS32
        # code. I.e., the linker will correctly adjust the JAL to JALX if
        # necessary
        ##################################################################
        and     a0,a0,0
        and     a1,a1,0
        la      t0,_main_entry
        jr      t0
        nop

 */

/* Usage
 * 1. Make new linker script from default one
 *    a. copy C:\Program Files (x86)\Microchip\xc32\v1.30\pic32mx\lib\ldscripts\elf32pic32mx.x
 *       to new script with .ld extension in linker files portion of the project.
 *    b.
 *
 *
 *
 *
 */

//


/*********************** defines, types, storage ******************************/
// define this to get state and other debugging messages
// moves the bootloader and does some other things
// makes image larger, so linker script may need modified to make room
// #define DEBUG_BOOTLOADER

// define this to cause flash operations to be ignored
// useful for testing when you don't want flash being changed
// #define IGNORE_FLASH_OPS

// from linker
extern const unsigned int _HCBOOT_LD_SIZE_;

// addresses to protect the bootloader
// todo - make BOOTLOADER_SIZE match the linker script automatically?
//#define BOOTLOADER_SIZE              0x2000 // must match linker script
#define BOOTLOADER_SIZE          ((uint32_t)(&_HCBOOT_LD_SIZE_))// must match linker script
#define BOOT_PHYSICAL_ADDRESS    0x1D000000 // note PHYSICAL address
#define BOOT_LOGICAL_ADDRESS     0x9D000000 // note LOGICAL address


// max number of 32-bit instructions scanned to detect bootloader
#define BOOT_INSTRUCTION_SEEK  12
// number of 32-bit instructions matched to detect bootloader
#define BOOT_INSTRUCTION_COUNT 6

// space needed for buffer overhead when loading write packets
#define BUFFER_OVERHEAD 20

// internal ram buffer size used for temp storage
#define BUFFER_SIZE (FLASH_PAGE_SIZE+BUFFER_OVERHEAD)

