ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
// used to put code items into the boot rom section we defined in the linker script
#define BOOT_CODE   __attribute__((section(".hcbcode"))) BOOTLOADER_MIPS
#define BOOT_CODE32 __attribute__((section(".hcbcode"))) __attribute__((mips32))

// used to put entry point into the boot rom section we defined in the linker script
// needs an extra section extension, else placed incorrectly in the section
#define BOOT_ENTRY __attribute__((section(".hcbcode.entry"))) BOOTLOADER_MIPS

// used to put data items into the boot rom section we defined in the linker script
// the ',r' part marks the data with a readonly attribute, for linker use
// use x for executable, b for BSS, r for read only, and d for writeable data
#define BOOT_DATA __attribute__((section(".hcbcode")))

// used to put items into the boot ram section we defined in the linker script
#define BOOT_RAM  __attribute__((section(".hcbram")))

// Any strings needed must be defined using this, to ensure the storage
// is in the proper flash section, otherwise the linker may put the
// text elsewhere
#define BOOTSTRING(name,text) BOOT_DATA static const char name[] = text

// use to set an item address. Requires logical address
#define FIX_ADDRESS(addr) __attribute__((address(addr)))

// times to retry a write before giving up
#define WRITE_RETY_MAX 5
        
// how to map logical addresses to physical addresses
#define LOGICAL_TO_PHYSICAL_ADDRESS(addr) ((addr)&0x1FFFFFFF)

// bootloader code version
//#define BOOTLOADER_VERSION_MAJOR 0
//#define BOOTLOADER_VERSION_MINOR 5
/*FIX_ADDRESS(BOOT_LOGICAL_ADDRESS+BOOTLOADER_SIZE - 16)*/
        // todo - get absolute address to work, so user can query, or make function?
BOOTSTRING(bootloaderVersion,"0.5");

// Send \r\n to UART
#define ENDLINE()  {BootUARTWriteByte('\r');BootUARTWriteByte('\n'); }

// write a single character with the high bit set, useful for debugging
// note that ASCII 'p'-'z and {|}~ will overlap NACK and ACK codes, so
// don't use them
#define ERROR(ch) BootUARTWriteByte((128|ch))

// write a single character, useful
#define WRITE(ch) BootUARTWriteByte(ch)

#define CRYPTO_ROUNDS 20 // for 20 rounds of Salsa20

// the byte that signals a positive outcome to the flashing utility
// has nice property that becomes different values at nearby baud rates
#define ACK  0xFC

// NACK is a byte, starts with 0xF0, has 16 lower nibble (0x0C is ACK)
#define NACK(reason) BootUARTWriteByte(0xF0+reason)
// NACK reasons
enum {

    // write problems
    NACK_CRC_MISMATCH             = 0x00,
    NACK_PACKET_SIZE_TOO_LARGE    = 0x01,
    NACK_WRITE_WITHOUT_ERASE      = 0x02,
    NACK_WRITE_SIZE_ERROR         = 0x03,
    NACK_WRITE_MISALIGNED_ERROR   = 0x04,
    NACK_WRITE_WRAPS_ERROR        = 0x05,
    NACK_WRITE_OUT_OF_BOUNDS      = 0x06,
    NACK_WRITE_OVER_CONFIGURATION = 0x07,
    NACK_WRITE_BOOT_MISSING       = 0x08,
    NACK_WRITE_FLASH_FAILED       = 0x09,
    NACK_COMPARE_FAILED           = 0x0A,
    NACK_WRITES_FAILED            = 0x0B,

    // reserved for ACK
    NACK_ACK_RESERVED             = 0x0C, 

    // system problems
    NACK_UNKNOWN_COMMAND          = 0x0D,

    // erase problems
    NACK_ERASE_OUT_OF_BOUNDS      = 0x0E,
    NACK_ERASE_FAILED             = 0x0F,

};

// outcomes of the bootloader code, for querying
// by the application
enum {
    BOOT_RESULT_SKIPPED = 0,
    BOOT_RESULT_SUCCESSFUL = 1,
    BOOT_RESULT_POWER_EXIT = 2,
    BOOT_RESULT_STARTED = 3,
    BOOT_SET_HARDWARE_FAILED = -1,
    BOOT_RESULT_ASSUMPTIONS_FAILED = -2,
};

// one return variable at bottom of ram
// to access from main code, use :
// extern __attribute__((section(".hcram"))) uint8_t bootResult;
// this variable needs to persist past crt0, so uses the
// "persistent" attribute, which has linker script support
// by default from microchip. Otherwise this result will not be seen in the
// user code. See
// http://www.microchip.com/forums/m594242.aspx
// http://www.microchip.com/forums/m434737.aspx#434882
BOOT_RAM uint8_t bootResult  __attribute__ ((persistent));

// this define must match the address of the boot result
#define BOOT_RESULT_VIRTUAL_ADDRESS 0xA0000000

// structure for tracking a timer
typedef struct
{
    // for timing
    uint32_t timerLast, timerNext, timerExcess;
    uint32_t timerCount;// counts ms or us depending on the timer mode
    uint32_t ticksPerCount; // can count many things, 
} Timer_t;

#ifdef USE_CRYPTO
// crypto state
typedef struct
{
    int i;
    uint32_t state[16]; // crypto state
    uint32_t x[16];     // crypto temp
    uint8_t output[64];
    int32_t bytes,d64;
} Crypto_t;
#endif

// this is all the local storage the boot loader needs
typedef struct
{
    // used to see if flash erased command has completed
    // must be done before writing allowed
    bool flashErased;

    // used to track timeouts and delays
    Timer_t timeoutTimerMs;

    // used for delays while writing flash
    Timer_t nvmTimerUs;

    // buffer for receiving pacekt of data from the flash utility
    uint8_t buffer[BUFFER_SIZE];
    // where in buffer to put next byte read
    int readPos;
    // number of bytes in packet when finished
    int readMax;

    // place to store CRC calculations
    uint32_t transmittedCrc,computedCrc;

    // temp address for iterating over memory
    uint32_t curAddress;

    // number of pages attempted to be erased
    uint32_t pageEraseAttemptCount;

    // number of pages failing to erase
    uint32_t pageEraseFailureCount;
    
    // address and size of data to write from the buffer into flash
    uint32_t writeSize, writeAddress;

    // number of writes that failed
    // could be rows or single words
    uint32_t writeFailureCount;

    // count packets since last erase
    uint32_t packetCounter;

    // set to true on last write packet seen
    bool writesFinished;

    // counter used to retry writes a few times when flashing
    uint32_t writeRetryCounter;

    // space for result of a flash write
    uint32_t flashWriteResult;

#ifdef USE_CRYPTO
    Crypto_t crypto;
#endif

} Boot_t;

/**************************** UART section ***********************************/
#if 0
// if there is any UART error, return 1, else return 0
// todo - clear errors?
BOOT_CODE static int BootUARTError()
{
        int err =
        U1STAbits.OERR | // overrun error
        U1STAbits.FERR | // framing error
        U1STAbits.PERR ; // parity error

        err |=
        U2STAbits.OERR | // overrun error
        U2STAbits.FERR | // framing error
        U2STAbits.PERR ; // parity error

        return err!=0?1:0;
}

#endif

// read byte if one is ready.
// if exists, return true and byte
// if return false, byte = 0 is none avail, else
// byte != 0 means error
BOOT_CODE static bool BootUARTReadByte(uint8_t * byte)
    {
    // if data ready, get it
    if (U1STAbits.URXDA != 0)
    {
        *byte = U1RXREG;
        return true;
    }
    *byte = 0;
    return false;
    } // UARTReadByte


