ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
// blocking call to write byte to UART
BOOT_CODE static void BootUARTWriteByte(char byte)
{
#ifdef HC_UART1
        while (!U1STAbits.TRMT);   // wait till bit clear, then ready to transmit
        U1TXREG = byte; // write a byte
#else
        while (!U2STAbits.TRMT);   // wait till bit clear, then ready to transmit
        U2TXREG = byte; // write a byte
#endif
}

// print the message to the serial port.
BOOT_CODE static void BootPrintSerial(const char * message)
{
    while (*message != 0)
    {
        BootUARTWriteByte(*message);
        message++;
    }
}

// print the integer to the serial port.
BOOT_CODE static void BootPrintSerialInt(uint32_t value)
{
    uint32_t pow10 = 1; // stack, ends on 0, so ok

    // want value/10 < pow10 < value
    while (pow10 <= value/10)
        pow10 *= 10;

    do
    {
        uint32_t digit = value/pow10;
        BootUARTWriteByte(digit+'0');
        value -= digit*pow10;
        pow10 /=10;
    } while (pow10 > 0);
}

// print the integer to the serial port as a n byte hex value
BOOT_CODE static void BootPrintSerialHexN(uint32_t value, int n)
{
    int i; // todo - remove from stack? ends on zero, so ok?
    for (i = n; i > 0; --i)
    {
        int val = (value>>(n*4-4))&15;
        if (val < 10)
            BootUARTWriteByte(val+'0');
        else
            BootUARTWriteByte(val+'A'-10);
        value<<=4;
    }
}

// print the integer to the serial port as a 4 byte hex value
BOOT_CODE static void BootPrintSerialHex(uint32_t value)
{
    WRITE('0');
    WRITE('x');
    BootPrintSerialHexN(value, 8);
}

// initialize the serial port
BOOT_CODE static void BootUARTInit()
{

#if defined(__32MX150F128B__)

#ifdef HC_UART1

    // UART1
    // U1RX on RPA4
    // U1TX on RPA0
    // clear PORTA bits
    LATACLR = (unsigned int)((1<<0) | (1<<4)); // BIT 0 and 4
    // set PORTA input pins
    TRISASET = (unsigned int)(1<<4);
    ANSELACLR = (unsigned int)(1<<4);
    // set PORTA output pins
    TRISACLR = (unsigned int)(1<<0);
    ANSELACLR = (unsigned int)(1<<0);

    U1RXR = 2; // RPB2 = U1RX
    RPA0R = 1; // PIN RPA0 = U1TX

    // clock divider
    U1BRG = SYS_CLOCK /(4*DESIRED_BAUDRATE) - 1;

    // mode
    U1MODE =
            (1<<15) | // module enable
            (1<< 3) | // 4x clock speed, high speed
            0;

    // TX/RX features
    U1STA =
            (1<<12) | // RX_ENABLE
            (1<<10) | // TX_ENABLE
            0;
#else
    todo - UART2
#endif

#else
    #pragma error "Unknown PIC version"
    todo - error!
#endif

}

// print debug messages if the debugging define is set, else ignore them
#ifdef DEBUG_BOOTLOADER
#define BootDebugPrint(message) BootPrintSerial(message)
#define BootDebugPrintE(message) {BootPrintSerial(message); ENDLINE();}
#else
#define BootDebugPrint(message)
#define BootDebugPrintE(message)
#endif

#ifdef DEBUG_BOOTLOADER
// helper function that dumps memory over serial as text
BOOT_CODE static void BootPrintMemory(const char * msg, uint32_t address, int length)
{
    // some memory dump to help debugging
    BootDebugPrintE(msg);
    int i;
    for (i = 0; i < length; ++i)
    {
        uint32_t addr = address + i;
        if ((i&7)==0)
        {
            BootPrintSerialHex(addr);
            BootPrintSerial(" : ");
        }
        BootPrintSerialHexN((uint8_t)(*((uint8_t*)addr)),2);
        BootPrintSerial(" ");
        if ((i&7)==7)
        {
            ENDLINE();
        }
    }
}
#else
#define BootPrintMemory(msg,address,length)
#endif

/*************************** Utility section **********************************/
// compute overlap of intervals [a0,a1) and [b0,b1)
BOOT_CODE static uint32_t BootOverlap(
    uint32_t a0, uint32_t a1,
    uint32_t b0, uint32_t b1)
{
    // trim [a0,a1) to the interval
    a0 = a0>b0?a0:b0; // max, lower bound of intersection interval, inclusive
    a1 = a1<b1?a1:b1; // min, upper bound of intersection interval, exclusive
    return a1<=a0?0:a1-a0; //if empty, return 0, else positive length
}

// set the core tick counter
BOOT_CODE32 static void BootWriteTimer(uint32_t time)
{
    asm volatile("mtc0   %0, $9": "+r"(time));
}

// read the core tick counter
BOOT_CODE32 static uint32_t BootReadTimer()
{
    uint32_t time;
    asm volatile("mfc0   %0, $9" : "=r"(time));
    return time;
}

// initialize the timer fields
// call with TICKS_PER_MILLISECOND or TICKS_PER_MICROSECOND
BOOT_CODE static void BootStartTimer(Timer_t * timer, uint32_t ticksPerCount)
{
    timer->timerLast   = BootReadTimer();
    timer->timerCount  = 0;
    timer->timerExcess = 0;
    timer->ticksPerCount = ticksPerCount;
}

// initialize the timer fields
// update the timer fields, and return current time since start in
// whatever tick sizes were selected at timer start
BOOT_CODE static uint32_t BootUpdateTimer(Timer_t * timer)
{
    timer->timerNext = BootReadTimer();
    if (timer->timerNext - timer->timerLast + timer->timerExcess >= timer->ticksPerCount)
    {
        timer->timerExcess = timer->timerNext - timer->timerLast + timer->timerExcess - timer->ticksPerCount;
        timer->timerCount++;
    }
    else
        timer->timerExcess += timer->timerNext - timer->timerLast;
    timer->timerLast = timer->timerNext;
    return timer->timerCount;
}


// wait the given number of counts based on the ticks per count parameter
// uses the Boot timer
BOOT_CODE static void BootDelay(Timer_t * timer, uint32_t ticksPerCount, int counts)
{
    BootStartTimer(timer, ticksPerCount);
    while (BootUpdateTimer(timer)<counts)
    {
        // do nothing
    }
}

BOOT_CODE static void BootReadBigEndian(uint32_t * answer, uint8_t * buffer, int32_t bytes)
{
    *answer = 0;
    while (bytes>0)
    {
        *answer <<= 8;
        *answer += *buffer;
        buffer++;
        bytes--;
    }
}


/*************************** CRC32K section ***********************************/

// Compute the CRC32K of the given data.
// done without tables to save space in bootloader
// The initial crc value should be 0, and this can be chained across calls.
// returns the new CRC
BOOT_CODE static uint32_t BootCrc32AddByteBitwise(uint8_t datum, uint32_t crc32)
{
    #define poly 0x741B8CD7U
    crc32 ^= (uint32_t)(datum << 24);
#if 1
    // 1 bit per line
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
    crc32 = (crc32 & 0x80000000U) == 0 ? (crc32<<1) : (crc32<<1)^poly;
#else
    // 2 bits per line
    static const uint32_t const tbl4 [] = {0,poly,poly<<1,(poly<<1)^poly};
    crc32 = tbl4[crc32>>30]^(crc32<<2);
    crc32 = tbl4[crc32>>30]^(crc32<<2);
    crc32 = tbl4[crc32>>30]^(crc32<<2);
    crc32 = tbl4[crc32>>30]^(crc32<<2);
#endif

    #undef poly
    return crc32;
}


/*************************** Decryption section *******************************/
#ifdef USE_CRYPTO

#define ROTATE(v,left) (((v)<<left)|((v)>>(32-left)))

#define QUARTERROUND(a,b,c,d) \
  cs->x[a] += cs->x[b]; cs->x[d] = ROTATE(cs->x[d]^cs->x[a],16); \
  cs->x[c] += cs->x[d]; cs->x[b] = ROTATE(cs->x[b]^cs->x[c],12); \
  cs->x[a] += cs->x[b]; cs->x[d] = ROTATE(cs->x[d]^cs->x[a], 8); \
  cs->x[c] += cs->x[d]; cs->x[b] = ROTATE(cs->x[b]^cs->x[c], 7)


BOOT_CODE static void BootCryptoUnpack(uint8_t * output, int index, uint32_t val)
{
    output[index++] = val;
    output[index++] = val >> 8;
    output[index++] = val >> 16;
    output[index]   = val >> 24;
}

BOOT_CODE static uint32_t BootCryptoPack(uint8_t * k, int index)
{
    return
        (uint32_t) (
            k[index] +
            (k[index + 1] << 8) +
            (k[index + 2] << 16) +
            (k[index + 3] << 24));
}

// output 64 bytes, input 16 uint32_t
BOOT_CODE static void BootCryptoNextState(
    Crypto_t * cs,
    uint8_t * output, 
    uint32_t *  input,
    int rounds)
{
    for (cs->i = 0; cs->i < 16; ++(cs->i))
        cs->x[cs->i] = input[cs->i];
    for (cs->i = rounds; cs->i > 0; cs->i -= 2)
    {
        QUARTERROUND( 0, 4, 8,12);
        QUARTERROUND( 1, 5, 9,13);
        QUARTERROUND( 2, 6,10,14);
        QUARTERROUND( 3, 7,11,15);
        QUARTERROUND( 0, 5,10,15);
        QUARTERROUND( 1, 6,11,12);
        QUARTERROUND( 2, 7, 8,13);
        QUARTERROUND( 3, 4, 9,14);
    }
    for (cs->i = 0; cs->i < 16; ++cs->i)
        cs->x[cs->i] += input[cs->i];
    for (cs->i = 0; cs->i < 16; ++cs->i)
        BootCryptoUnpack(output, 4*cs->i, cs->x[cs->i]);
}


// Set the key, given a key of 128 or 256 bits in length
// Set the initialization vector, 64 bits
BOOT_CODE static void BootCryptoSetKeyAndInitializationVector(
    Crypto_t * cs,
    uint8_t * keyBytes,
    uint32_t keyBits,
    uint8_t * initializationVectorBytes
    )
{
// 16 byte ASCII constants as bytes
// these must be located in this section!
// linker may move strings, so cannot use them.

    cs->i = 0; // key offset
    if (keyBits == 256)
    {
        cs->i = 16;
        //uint8_t * sigma = "expand 32-byte k";
        //cs->constants = sigma;
        // set constants
        //cs->state[0] = BootCryptoPack(cs->constants, 0);
        //cs->state[1] = BootCryptoPack(cs->constants, 4);
        //cs->state[2] = BootCryptoPack(cs->constants, 8);
        //cs->state[3] = BootCryptoPack(cs->constants, 12);

