ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
        // hex for ASCII for "expand 32-byte k";
        cs->state[0] = 0x61707865;
        cs->state[1] = 0x3320646E;
        cs->state[2] = 0x79622D32;
        cs->state[3] = 0x6B206574;        
    }
    else if (keyBits == 128)
    {
        //uint8_t * tau   = "expand 16-byte k";
        // cs->constants = tau;
        // set constants
        //cs->state[0] = BootCryptoPack(cs->constants, 0);
        //cs->state[1] = BootCryptoPack(cs->constants, 4);
        //cs->state[2] = BootCryptoPack(cs->constants, 8);
        //cs->state[3] = BootCryptoPack(cs->constants, 12);

        // hex for ASCII for "expand 16-byte k";
        cs->state[0] = 0x61707865;
        cs->state[1] = 0x3120646E;
        cs->state[2] = 0x79622D36;
        cs->state[3] = 0x6B206574;
    }
    else
    {
        BootDebugPrintE("ERROR: Key invalid length");
        return;
    }
    // set key bytes
    cs->state[4] = BootCryptoPack(keyBytes, 0);
    cs->state[5] = BootCryptoPack(keyBytes, 4);
    cs->state[6] = BootCryptoPack(keyBytes, 8);
    cs->state[7] = BootCryptoPack(keyBytes, 12);
    cs->state[8] = BootCryptoPack(keyBytes, 0 + cs->i);
    cs->state[9] = BootCryptoPack(keyBytes, 4 + cs->i);
    cs->state[10] = BootCryptoPack(keyBytes, 8 + cs->i);
    cs->state[11] = BootCryptoPack(keyBytes, 12 + cs->i);
    // block counter to 0
    cs->state[12] = 0;
    cs->state[13] = 0;
    // set IV
    cs->state[14] = BootCryptoPack(initializationVectorBytes, 0);
    cs->state[15] = BootCryptoPack(initializationVectorBytes, 4);
}

// note encrypt and decrypt are the same function
BOOT_CODE static void BootCryptoDecrypt(
        Crypto_t * cs,
        uint8_t * messageBytes,
        uint32_t messageLength,
        uint8_t * cypherBytes,
        int rounds)
{
    cs->bytes = messageLength;
    if (rounds < 1)
    {
        BootDebugPrintE("ERROR: Crypto rounds must be positive");
        return;
    }

    if (cs->bytes == 0) return;
    cs->d64 = 0;
    for (;;)
    {
        // update internal state and increment 64 bit counter
        BootCryptoNextState(cs,cs->output, cs->state, rounds);

#ifdef DEBUG_BOOTLOADER
        if (cs->state[12] < 3)
        {
            BootPrintMemory("Enc output: ", (uint32_t)(cs->output), 64);
        }
#endif

        cs->state[12]++;
        if (cs->state[12] == 0)
        {
            cs->state[13]++;
            /* stopping at 2^70 bytes per nonce is user's responsibility */
        }
        if (cs->bytes <= 64)
        {
            for (cs->i = 0; cs->i < cs->bytes; ++cs->i)
                cypherBytes[cs->i + cs->d64] = (messageBytes[cs->i + cs->d64] ^ cs->output[cs->i]);
            return;
        }
        for (cs->i = 0; cs->i < 64; ++cs->i)
            cypherBytes[cs->i + cs->d64] = (messageBytes[cs->i + cs->d64] ^ cs->output[cs->i]);
        cs->bytes -= 64;
        cs->d64 += 64;
    }
}
#endif // USE_CRYPTO

/*************************** Flash writing section*****************************/

#define NVM_OP_CLEAR_ERROR   0x4000      // clears the error by executing a nop
#define NVM_OP_WRITE_WORD    0x4001      // write a 32 bit word
#define NVM_OP_WRITE_ROW     0x4003      // write a row
#define NVM_OP_ERASE_PAGE    0x4004      // erase a page

// return true on success, else false
BOOT_CODE static bool BootNVMemOperation(Boot_t * bs, uint32_t nvmop)
{
#ifdef IGNORE_FLASH_OPS
    return true; // do not change anything
#else
    // Enable Flash Write/Erase Operations
    NVMCON = NVMCON_WREN | nvmop;
    // Data sheet prescribes 6us delay for LVD to become stable.
    // we wait 7
    BootDelay(&(bs->nvmTimerUs), TICKS_PER_MICROSECOND,7);

    // write enable sequence
    NVMKEY 	= 0xAA996655;
    NVMKEY 	= 0x556699AA;
    NVMCONSET 	= NVMCON_WR;

    // Wait for WR bit to clear
    while(NVMCON & NVMCON_WR);

    // Disable Flash Write/Erase operations
    NVMCONCLR = NVMCON_WREN;

    // check success
    nvmop = NVMCON;
    if (nvmop & (1<<12))
    {
        ERROR('L'); // low voltage detect error bit
    }
    if (nvmop & (1<<13))
    {
        ERROR('W'); // write error bit
    }

    if (nvmop & 0x3000)
    { // must clear error bit
        ERROR('C'); // write noise
        if (!BootNVMemOperation(bs,NVM_OP_CLEAR_ERROR))
        {
            // massive error? infinite loop?
            while (1)
            {
                ERROR('@');
                BootDelay(&(bs->nvmTimerUs),TICKS_PER_MILLISECOND,1000);
            }
        }
    }

    return (nvmop&0x3000)?false:true;
#endif
}

// write 32 bit value to given physical address
// address must be word aligned else fails
// return true on success, else false
BOOT_CODE static bool BootNVMemWriteWord(Boot_t * bs, uint32_t physicalDestinationAddress, uint32_t data)
{
    if (physicalDestinationAddress&(3U))
    {
        ERROR('a');
        return false; // not aligned
    }
    NVMADDR = physicalDestinationAddress;
    NVMDATA = data;
    return BootNVMemOperation(bs,NVM_OP_WRITE_WORD);
}

// write 32 bit value to given physical address
// address must be row aligned else fails
// the Boot Struct must have the proper page size set
// return true on success, else false
BOOT_CODE static bool BootNVMemWriteRow(Boot_t * bs, uint32_t physicalDestinationAddress,  const uint32_t * physicalData)
{
    if (physicalDestinationAddress & (FLASH_ROW_SIZE-1))
    {
        ERROR('a');
        return false;
    }

    // must be word aligned
    if (((uint32_t)physicalData) & (3U))
    {
        ERROR('b');
        return false;
    }

    NVMADDR = physicalDestinationAddress;
    NVMSRCADDR = (uint32_t)physicalData;
    return BootNVMemOperation(bs,NVM_OP_WRITE_ROW);
}

// erase page
// address must be page aligned else fails
// the Boot Struct must have the proper page size set
// return true on success, else false
BOOT_CODE static bool BootNVMemErasePage(Boot_t * bs, uint32_t physicalDestinationAddress)
{
    if (physicalDestinationAddress & (FLASH_PAGE_SIZE-1))
        return false;
    NVMADDR = physicalDestinationAddress;
    return BootNVMemOperation(bs,NVM_OP_ERASE_PAGE);
}

