ChrisAtHypnocube/PIC32Bootloader/BootLoader.X/BootLoader.c
    return false;
}


// setup any hardware for outside communication
// return true on success
BOOT_CODE static bool BootSetHardware()
{
    BootUARTInit();
    LED_INIT();
    return  true;
}

BOOT_CODE static void BootSoftReset()
{
    /* The following code illustrates a software Reset */
    // assume interrupts are disabled
    // assume the DMA controller is suspended
    // assume the device is locked
    /* perform a system unlock sequence */
    // starting critical sequence
    SYSKEY = 0x00000000; // write invalid key to force lock
    SYSKEY = 0xAA996655; // write key1 to SYSKEY
    SYSKEY = 0x556699AA; // write key2 to SYSKEY
    // OSCCON is now unlocked
    /* set SWRST bit to arm reset */
    RSWRSTSET = 1;
    /* read RSWRST register to trigger reset */
    unsigned int dummy;
    dummy = RSWRST;

    /* prevent any unwanted code execution until reset occurs*/
    while(1);
}

// run the bootloader
BOOT_ENTRY FIX_ADDRESS(BOOT_LOGICAL_ADDRESS) uint8_t BootloaderEntry()
{
    // assume power check succeeds, set reason
    bootResult = BOOT_RESULT_POWER_EXIT;
    
    // if not power on reset, jump to user code (old boot code from application)
    if ((RCON & 0x0003) == 0)
        return; // jump to app code

    // assume power check succeeds, set reason
    bootResult = BOOT_RESULT_ASSUMPTIONS_FAILED;

    // check assumptions about memory, etc., are met
    if (BootTestAssumptions() == false)
        return; // jump to app code

    // set current return code
    bootResult = BOOT_RESULT_STARTED;

    // start timing events
    BootWriteTimer(0);

    // keep all memory on stack to prevent linker from
    // reserving RAM. There is one global variable for the
    // application to read. It also has the effect of
    // keeping the stack fairly clean

    // we need the buffer in the boot structure to be word aligned,
    // so we allocate extra space (enough in two directions so we don't have
    // to worry about stack directions)
    uint8_t space[sizeof(Boot_t)+10];

    Boot_t * bs = (Boot_t*)(space+5);

    while (((uint32_t)(bs->buffer)) & (3))
    {
        // move one byte ahead
        bs = (Boot_t*)(((uint8_t*)bs)+1);
    }

    // 1. init listening hardware
    if (BootSetHardware())
    {
        BootDebugPrintE("Hardware set");
        
        // show LED if present
        LED_ON();

        // needs erased before writing is allowed
        bs->flashErased = false;

        // 2. See if flashing attempted
        if (BootDetectFlashingAttempt(bs))
        {
            BOOTSTRING(flashText01,"Flasher detected at ");
            BOOTSTRING(flashText02," ms.");

            // print time connected, useful for debugging
            BootPrintSerial(flashText01);
            BootPrintSerialInt(BootReadTimer()/TICKS_PER_MILLISECOND);
            BootPrintSerial(flashText02);
            ENDLINE();

            // 3. If flashing, do it
            BootRunCommandLoop(bs);

            BootDebugPrintE("Command loop exited");
        }
    }
    else
        bootResult = BOOT_SET_HARDWARE_FAILED;

    // 4. zero used memory to avoid leaks. Still leaks return addresses and some stack stuff
    // count down to end on zero, which is more likely then to be the value left on the stack
    int i;
    for (i = sizeof(Boot_t); i > 0; i--)
        ((uint8_t*)(bs))[i-1] = 0;

    // todo - some options
    // infinite loop till power cycle if flashed
    // clear all ram to prevent leakage?
    // softreset device?

    BOOTSTRING(flashText03, "Leaving bootloader code....");
    BootPrintSerial(flashText03);
    ENDLINE();

    // reset device
    //BootDebugPrint("and resetting device...");
    //BootSoftReset();

    return bootResult;
}

// end of file

